Repository: Dharshini-redrouthu/MiniProject
Catalog: locale/*/LC_MESSAGES/django.po
Languages: te

source: Account verified successfully!
te: ఖాతా విజయవంతంగా ధృవీకరించబడింది!

source: Invalid OTP
te: చెల్లని OTP

source: Welcome to AgriNest
te: అగ్రి నెస్ట్‌కు స్వాగతం

source: Your one-stop solution for all agricultural needs
te: మీ అన్ని వ్యవసాయ అవసరాలకు ఒకే చోట పరిష్కారం

source: Season Offers
te: సీజన్ ఆఫర్లు

source: Add to Cart
te: కార్ట్‌లో వేసుకోండి

source: No featured products yet.
te: ఇంకా ఫీచర్ చేయబడిన ఉత్పత్తులు లేవు.

source: Crop Support Pools
te: పంట మద్దతు నిధులు

source: Target:
te: లక్ష్యం:

source: Raised:
te: సేకరించబడింది:

source: Created by:
te: సృష్టించినవారు:

source: Active
te: క్రియాశీలం

source: Inactive
te: నిష్క్రియ

source: Created on
te: సృష్టించిన తేదీ

source: No crop support pools available yet.
te: ఇప్పటికీ పంట మద్దతు నిధులు అందుబాటులో లేవు.
